Show / Hide Table of Contents
Class OpenMessages
Open messages collection
Inheritance
System.Object
OpenMessages
Inherited Members
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Message
Assembly: IdeaRS.OpenModel.dll
Syntax
[Obfuscation(Feature = "renaming")]
[DataContract]
public class OpenMessages
Constructors
Improve this Doc   View Source
OpenMessages()
Constructor
Declaration
public OpenMessages()
Properties
Improve this Doc   View Source
ErrorMessages
List Error messages only
Declaration
public List<ErrorMessage> ErrorMessages { get; }
Property Value
 Type |  Description
 System.Collections.Generic.List<ErrorMessage>
Improve this Doc   View Source
InformationMessages
List Information messages only
Declaration
public List<InformationMessage> InformationMessages { get; }
Property Value
 Type |  Description
 System.Collections.Generic.List<InformationMessage>
Improve this Doc   View Source
Messages
List of messages
Declaration
[DataMember]
public List<OpenMessage> Messages { get; set; }
Property Value
 Type |  Description
 System.Collections.Generic.List<OpenMessage>
Improve this Doc   View Source
WarningMessages
List Worning messages only
Declaration
public List<WarningMessage> WarningMessages { get; }
Property Value
 Type |  Description
 System.Collections.Generic.List<WarningMessage>
Methods
Improve this Doc   View Source
Add(OpenMessage)
Add a message
Declaration
public void Add(OpenMessage message)
Parameters
 Type |  Name |  Description
 OpenMessage |  message
Message to be added
Improve this Doc   View Source
Remove(OpenMessage)
Remove a message
Declaration
public void Remove(OpenMessage message)
Parameters
 Type |  Name |  Description
 OpenMessage |  message
Message will be removed
 Improve this Doc
 View Source